MINI_PROJECT

In [41]:
import pandas as pd
df=pd.read_csv("/content/sample_data/stats.csv")
df

        Name  Salary Country
0      Nupur   40700   India
1  Elizabeth   32000     UAE
2      Jayan   45000      UK
3      Manav   54800   India
4      Mayur   76700   India
5       Bill   62000      UK
6      Jassy   92000     UAE
7        Jay   98000   India
8      Maria   35000     UAE
9     Bhuvan   48000      UK

In [42]:
mean1=df['Salary'].mean()
mean1

58420.0

In [43]:
sum1=df['Salary'].sum()
sum1

584200

In [44]:
max1=df['Salary'].max()
max1

98000

In [45]:
min1=df['Salary'].min()
min1

32000

In [48]:
count1=df['Salary'].count()
count1

10

In [49]:
median=df['Salary'].median()
median

51400.0

In [50]:
mode1=df['Salary'].mode()
mode1

0    32000
1    35000
2    40700
3    45000
4    48000
5    54800
6    62000
7    76700
8    92000
9    98000
dtype: int64

In [51]:
countrywise_sum=df.groupby(['Country'])['Salary'].sum()
countrywise_sum

Country
India    270200
UAE      159000
UK       155000
Name: Salary, dtype: int64

In [52]:
countrywise_count=df.groupby(['Country']).count()
countrywise_count

         Name  Salary
Country
India       4       4
UAE         3       3
UK          3       3

In [53]:
var1=df['Salary'].var()
var1

544828444.4444444

In [54]:
std1=df['Salary'].std()
std1

23341.560454357896

In [55]:
skew1=df.skew(axis=0, skipna=True)
skew1

Salary   0.72
dtype: float64

In [57]:
bw=pd.read_csv('/content/sample_data/Weight.csv')
bw.head()

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                    34.70                  1895
1          2                    36.00                  2030
2          3                    29.30                  1440
3          4                    40.10                 27835
4          5                    35.70                  3090

In [58]:
bw.cov()

,Infant ID,Gestational Age (Weeks),Birth Weight (Grams)
Infant ID,25.50,"2,083.42","118,520.50"
Gestational Age (Weeks),"2,083.42","2,651,120.36","-12,189,980.12"
Birth Weight (Grams),"118,520.50","-12,189,980.12","7,806,312,576.39"

In [59]:
bw.corr(method="pearson")

,Infant ID,Gestational Age (Weeks),Birth Weight (Grams)
Infant ID,1.00,0.25,0.27
Gestational Age (Weeks),0.25,1.00,-0.08
Birth Weight (Grams),0.27,-0.08,1.00

In [61]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import skew
from scipy.stats import kurtosis
pd.set_option("display.max_columns",None)  # to display all the columns
pd.options.display.float_format = "{:,.2f}".format # to display float value upto two decimals
xls = pd.read_csv('/content/sample_data/Perls.csv')
xls.head()

   id  carat      cut color clarity  depth  table  price    x    y    z
0   1   0.23    Ideal     E     SI2  61.50  55.00    326 3.95 3.98 2.43
1   2   0.21  Premium     E     SI1  59.80  61.00    326 3.89 3.84 2.31
2   3   0.23     Good     E     VS1  56.90  65.00    327 4.05 4.07 2.31
3   4   0.29  Premium     I     VS2  62.40  58.00    334 4.20 4.23 2.63
4   5   0.31     Good     J     SI2  63.30  58.00    335 4.34 4.35 2.75

In [38]:
des_df = xls.drop(['id'],axis = 1) # drop id column
for col in des_df:   # drop all alpha-numeric columns
  if des_df[col].dtype == 'object':
    des_df = des_df.drop([col], axis = 1)

des_r = des_df.describe() # describe() gives us mean,min,max,median,1Q,3Q,std
des_r = des_r.rename(index={'50%':'median/50%'}) 
des_r

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80

In [62]:
var_r = des_df.var() # calulating variance seperately

varlist = []
for col in des_df.columns: # converting result of var() from series to list
  if des_df[col].dtype == 'object':
    continue
  varlist.append(round(des_df[col],5))

df = pd.DataFrame([varlist],columns=des_r.columns, index=['var']) # putting results of variance into dataframe
mct = des_r.append(df) # adding var to describe result
mct

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80
var,0 0.23 1 0.21 2 0.23 3 ...,0 61.50 1 59.80 2 56.90 3 ...,0 55.00 1 61.00 2 65.00 3 ...,0 326 1 326 2 327 3 ...,0 3.95 1 3.89 2 4.05 3 ...,0 3.98 1 3.84 2 4.07 3 ...,0 2.43 1 2.31 2 2.31 3 ...